# Rekall 설치
+ git for windows 설치
+ 윈도우즈용 컴파일러 설치 
    - https://wiki.python.org/moin/WindowsCompilers
    - python 3.5 - 3.8 은 vs 14.x 버전 설치 필요
    - visual studio setup -> 컴파일러, 빌드 도구 및 런타임 -> build tools 설치해야 함
        ```
        ...
        error: Setup script exited with error: Microsoft Visual C++ 14.0 or greater is required. Get it with "Microsoft C++ Build Tools": https://visualstudio.microsoft.com/visual-cpp-build-tools/
        ...
        ```

+ rekall 실행 환경 구성 (관리자 사용자 권한으로)
    ```
    >conda create --name rekall python=3.8.5
    >activate rekall
    >pip install --upgrade setuptools pip wheel --user
    >conda install -c anaconda pywin32
    >conda install -c saedrna capstone
    ```

+ rekall 소스코드 다운로드 && 설치
    ```
    >git clone https://github.com/somma-inc/rekall.git c:\work.rekall
    >cd rekall-core
    >python setup.py install        (최초 빌드/설치시 관리자권한으로, 일반 사용자권한으로 하면 에러남)
    ```

# 참고
+ Official rekall
    - https://github.com/google/rekall/
    - [Rekall tutorial](http://www.rekall-forensic.com/documentation-1/rekall-documentation/tutorial)
    - [fixes bug in VA translation process (#538)](https://github.com/google/rekall/commit/b6f632f167c7d5cd80decf6fcb5481b45e38101c)
    - [winpmem](https://github.com/google/rekall/tree/master/tools/windows/winpmem)

+ FireEye fork version (add memory compression analysis)
    - https://github.com/fireeye/win10_rekall
    - https://github.com/fireeye/win10_rekall/commit/2027518aae789e54d408cd8e2e414557122a6096


    O        O      O      0x0000e303ca9a3080    O   svchost.exe, svchost.exe, svchost.exe
    O        O      O      0x0000e303ca18d080    O   svchost.exe, svchost.exe, svchost.exe
    O        O      O      0x0000e303c9957080    O   svchost.exe, svchost.exe, svchost.exe
    O        O             0x0000e303cc145340        MicrosoftEdge.exe, MicrosoftEdge.
    O        O      O      0x0000e303c8d96080    O   browser_broker.exe, browser_broker, browser_broker
    O        O             0x0000e303c9c5b080        MicrosoftEdgeSH.exe, MicrosoftEdgeS
    O        O             0x0000e303cc343080        MicrosoftEdgeCP.exe, MicrosoftEdgeC
    O        O             0x0000e303cc411340        Code.exe, Code.exe
    O        O      O      0x0000e303cc21c340    O   taskhostw.exe, taskhostw.exe, taskhostw.exe
    O        O      O      0x0000e303cc92a080    O   TOTALCMD64.EXE, TOTALCMD64.EXE, TOTALCMD64.EXE
    O        O      O      0x0000e303cc2c7080    O   ShellExperienceHost.exe, ShellExperienc, ShellExperienc
    O        O             0x0000e303c872d080        RuntimeBroker.exe, RuntimeBroker.
    O        O      O      0x0000e303cc7fb080    O   cmd.exe, cmd.exe, cmd.exe
    O        O             0x0000e303cdcc5300        conhost.exe, conhost.exe
    O        O      O      0x0000e303caa57080    O   svchost.exe, svchost.exe, svchost.exe
    O        O      O      0x0000e303cc2c3080    O   Microsoft.Photos.exe, Microsoft.Phot, Microsoft.Phot
    O        O      O      0x0000e303ca0a8080    O   RuntimeBroker.exe, RuntimeBroker., RuntimeBroker.
    O        O      O      0x0000e303cc91b080    O   svchost.exe, svchost.exe, svchost.exe
             O      O      0x0000e303c9c79080        rekal.exe, rekal.exe
             O      O      0x0000e303caa3a080        python.exe, python.exe
                    O      0x0000e303c4f3a080        git.exe
                    O      0x0000e303c9320080        SearchFilterHo
                    O      0x0000e303c93d2080        git.exe
                    O      0x0000e303cc07d080        taskhostw.exe
                    O      0x0000e303cc310080        git.exe
                    O      0x0000e303cc688080        git.exe
    --------------------------------------------------
    85      87     60                           52

    Process finished with exit code 0

    ```

## winpmem driver 관련
+ 2020.10.09 일 현재 
  - rekall 의 winpmem 버전은 `#define PMEM_VERSION "v1.6.3"`  (https://github.com/google/rekall)
  - 개발자의 최신 버전은 `#define PMEM_DRIVER_VERSION "2.0.1"`  (https://github.com/Velocidex/WinPmem)
  - 두 드라이버 호환 안됨
  - 많은 부분에서 변경이 있고, 개선된 버전으로 보임 (예외처리 코드등)
  - python 도구는 현재 개발중, user mode exe 프로그램은 개발 완료 되었으나 테스트 안해봤음
  - 아무튼 이전 버전의 rekall 과는 호환되지 않음
+ https://github.com/somma-inc/rekall/commit/d410e5adbce10f737096eaab4b0a88caa1889cd9 커밋에서 수정 완료


## _OBJECT_HEADER.TypeIndex 관련 리서치

- https://medium.com/@ashabdalhalim/a-light-on-windows-10s-object-header-typeindex-value-e8f907e7073a

    ```
    0: kd> dt _object_header -v
    nt!_OBJECT_HEADER
    struct _OBJECT_HEADER, 23 elements, 0x38 bytes
    +0x000 PointerCount     : Int8B
    +0x008 HandleCount      : Int8B
    +0x008 NextToFree       : Ptr64 to Void
    +0x010 Lock             : struct _EX_PUSH_LOCK, 7 elements, 0x8 bytes
    +0x018 TypeIndex        : UChar                                                      <<!!!>>
    +0x019 TraceFlags       : UChar
    +0x019 DbgRefTrace      : Bitfield Pos 0, 1 Bit
    +0x019 DbgTracePermanent : Bitfield Pos 1, 1 Bit
    +0x01a InfoMask         : UChar
    +0x01b Flags            : UChar
    +0x01b NewObject        : Bitfield Pos 0, 1 Bit
    +0x01b KernelObject     : Bitfield Pos 1, 1 Bit
    +0x01b KernelOnlyAccess : Bitfield Pos 2, 1 Bit
    +0x01b ExclusiveObject  : Bitfield Pos 3, 1 Bit
    +0x01b PermanentObject  : Bitfield Pos 4, 1 Bit
    +0x01b DefaultSecurityQuota : Bitfield Pos 5, 1 Bit
    +0x01b SingleHandleEntry : Bitfield Pos 6, 1 Bit
    +0x01b DeletedInline    : Bitfield Pos 7, 1 Bit
    +0x01c Reserved         : Uint4B
    +0x020 ObjectCreateInfo : Ptr64 to struct _OBJECT_CREATE_INFORMATION, 9 elements, 0x40 bytes
    +0x020 QuotaBlockCharged : Ptr64 to Void
    +0x028 SecurityDescriptor : Ptr64 to Void
    +0x030 Body             : struct _QUAD, 2 elements, 0x8 bytes                


    0: kd> dps nt!ObTypeIndexTable
    fffff803`22a2cd80  00000000`00000000
    fffff803`22a2cd88  ffffa180`5758e000
    fffff803`22a2cd90  ffff830d`a0ccd4e0
    fffff803`22a2cd98  ffff830d`a0ccd640
    fffff803`22a2cda0  ffff830d`a0ccd7a0
    fffff803`22a2cda8  ffff830d`a0ccda60
    fffff803`22a2cdb0  ffff830d`a0ccd900
    fffff803`22a2cdb8  ffff830d`a0ccde80
    fffff803`22a2cdc0  ffff830d`a0cd4980
    fffff803`22a2cdc8  ffff830d`a0cd30c0
    fffff803`22a2cdd0  ffff830d`a0cd3640
    fffff803`22a2cdd8  ffff830d`a0cd3900
    fffff803`22a2cde0  ffff830d`a0cd3220
    fffff803`22a2cde8  ffff830d`a0cd3d20
    fffff803`22a2cdf0  ffff830d`a0cd3a60
    fffff803`22a2cdf8  ffff830d`a0cd4140


    0: kd> dt _OBJECT_TYPE ffffbd05`81e3f620 -s
    nt!_OBJECT_TYPE
    +0x000 TypeList         : _LIST_ENTRY [ 0xffffbd05`81e3f620 - 0xffffbd05`81e3f620 ]
    +0x010 Name             : _UNICODE_STRING "Directory"
    +0x020 DefaultObject    : 0xfffff805`64065a00 Void
    +0x028 Index            : 0x3 ''
    +0x02c TotalNumberOfObjects : 0x48
    +0x030 TotalNumberOfHandles : 0x104
    +0x034 HighWaterNumberOfObjects : 0x56
    +0x038 HighWaterNumberOfHandles : 0x152
    +0x040 TypeInfo         : _OBJECT_TYPE_INITIALIZER
    +0x0b8 TypeLock         : _EX_PUSH_LOCK
    +0x0c0 Key              : 0x65726944
    +0x0c8 CallbackList     : _LIST_ENTRY [ 0xffffbd05`81e3f6e8 - 0xffffbd05`81e3f6e8 ]

    0: kd> dt _OBJECT_TYPE ffffbd05`81e3fcd0 -s
    nt!_OBJECT_TYPE
    +0x000 TypeList         : _LIST_ENTRY [ 0xffffbd05`81e3fcd0 - 0xffffbd05`81e3fcd0 ]
    +0x010 Name             : _UNICODE_STRING "SymbolicLink"
    +0x020 DefaultObject    : 0xfffff805`64065a00 Void
    +0x028 Index            : 0x4 ''
    +0x02c TotalNumberOfObjects : 0x125
    +0x030 TotalNumberOfHandles : 0x85
    +0x034 HighWaterNumberOfObjects : 0x134
    +0x038 HighWaterNumberOfHandles : 0x9a
    +0x040 TypeInfo         : _OBJECT_TYPE_INITIALIZER
    +0x0b8 TypeLock         : _EX_PUSH_LOCK
    +0x0c0 Key              : 0x626d7953
    +0x0c8 CallbackList     : _LIST_ENTRY [ 0xffffbd05`81e3fd98 - 0xffffbd05`81e3fd98 ]
    ```

+ `!poolfind` 로 찾은 pool 의 type 을 찾아보자

    ```
    0: kd> !poolfind -tag Proc -nonpaged
    ...
    ffff830da0ce8010 : tag Proc, size     0xc70, Nonpaged pool
    ...
    ```

+ 1 번 pool, `ffff830da0ce8010` 추적        
    ```
    1: kd> dt _OBJECT_HEADER -s
    nt!_OBJECT_HEADER
    +0x000 PointerCount     : Int8B
    +0x008 HandleCount      : Int8B
    +0x008 NextToFree       : Ptr64 Void
    +0x010 Lock             : _EX_PUSH_LOCK
    +0x018 TypeIndex        : UChar             <<!>>
    +0x019 TraceFlags       : UChar
    +0x019 DbgRefTrace      : Pos 0, 1 Bit
    +0x019 DbgTracePermanent : Pos 1, 1 Bit
    +0x01a InfoMask         : UChar
    +0x01b Flags            : UChar
    +0x01b NewObject        : Pos 0, 1 Bit
    +0x01b KernelObject     : Pos 1, 1 Bit
    +0x01b KernelOnlyAccess : Pos 2, 1 Bit
    +0x01b ExclusiveObject  : Pos 3, 1 Bit
    +0x01b PermanentObject  : Pos 4, 1 Bit
    +0x01b DefaultSecurityQuota : Pos 5, 1 Bit
    +0x01b SingleHandleEntry : Pos 6, 1 Bit
    +0x01b DeletedInline    : Pos 7, 1 Bit
    +0x01c Reserved         : Uint4B
    +0x020 ObjectCreateInfo : Ptr64 _OBJECT_CREATE_INFORMATION
    +0x020 QuotaBlockCharged : Ptr64 Void
    +0x028 SecurityDescriptor : Ptr64 Void
    +0x030 Body             : _QUAD


    0: kd> dt _OBJECT_HEADER ffff830da0ce8010 -s
    nt!_OBJECT_HEADER
    +0x000 PointerCount     : 0n0
    +0x008 HandleCount      : 0n-137380385956880
    +0x008 NextToFree       : 0xffff830d`a2e55bf0 Void
    +0x010 Lock             : _EX_PUSH_LOCK
    +0x018 TypeIndex        : 0x28 '('          <<!>>
    +0x019 TraceFlags       : 0x80 ''
    +0x019 DbgRefTrace      : 0y0
    +0x019 DbgTracePermanent : 0y0
    +0x01a InfoMask         : 0xce ''
    +0x01b Flags            : 0xa0 ''
    +0x01b NewObject        : 0y0
    +0x01b KernelObject     : 0y0
    +0x01b KernelOnlyAccess : 0y0
    +0x01b ExclusiveObject  : 0y0
    +0x01b PermanentObject  : 0y0
    +0x01b DefaultSecurityQuota : 0y1
    +0x01b SingleHandleEntry : 0y0
    +0x01b DeletedInline    : 0y1
    +0x01c Reserved         : 0x20
    +0x020 ObjectCreateInfo : 0x00000a88`00001000 _OBJECT_CREATE_INFORMATION
    +0x020 QuotaBlockCharged : 0x00000a88`00001000 Void
    +0x028 SecurityDescriptor : 0x00000000`0000006c Void
    +0x030 Body             : _QUAD

    ```

+ `TypeIndex` 값은 인코딩 되어있으며 디코딩 루틴은 `nt!ObGetObjectType` 함수를 리버싱해서 알아낸다.

    ```
    1: kd> uf nt!ObGetObjectType
    nt!ObGetObjectType:
    fffff805`641fcb20 488d41d0        lea     rax,[rcx-30h]
    fffff805`641fcb24 0fb649e8        movzx   ecx,byte ptr [rcx-18h]
    fffff805`641fcb28 48c1e808        shr     rax,8
    fffff805`641fcb2c 0fb6c0          movzx   eax,al
    fffff805`641fcb2f 4833c1          xor     rax,rcx
    fffff805`641fcb32 0fb60d475bf9ff  movzx   ecx,byte ptr [nt!ObHeaderCookie (fffff805`64192680)]
    fffff805`641fcb39 4833c1          xor     rax,rcx
    fffff805`641fcb3c 488d0d3d62f9ff  lea     rcx,[nt!ObTypeIndexTable (fffff805`64192d80)]
    fffff805`641fcb43 488b04c1        mov     rax,qword ptr [rcx+rax*8]
    fffff805`641fcb47 c3              ret

    0: kd> db nt!ObHeaderCookie l1
    fffff803`22a2c680  a0 
    ```

+ ObTypeIndexTable[`Object 의 주소 하위 두번째 바이트` xor `ObHeaderCookie` xor `TypeIndex`]
    ```
    int64_t ObGetObjectType(uint64_t object_address)
    {
        POBJECT_HEADER ObjectHeader = CONTAINING_RECORD(object_address, OBJECT_HEADER, Body);   // rcx-30h
        char TypeIndex = ObjectHeader->TypeIndex;           // rcx-18h
        int8_t value = (int8_t)(ObjectHeader >> 8);
        return (int64_t) ObTypeIndexTable[ntObHeaderCookie ^ value ^ TypeIndex];
    }
    ```

+ Object 의 주소는 `ffff830da0ce8010` 이므로 `0x80` ^ `0xa0` ^ `0x28` 식으로 디코딩하면 됨 (엥..!! Proc 이 아니라 Thread?!)

    ```
    0: kd> ? 0x80 ^ 0xa0 ^ 0x28
    Evaluate expression: 8 = 00000000`00000008

    0: kd> dt nt!_OBJECT_TYPE poi(nt!ObTypeIndexTable + (8*8))
    +0x000 TypeList         : _LIST_ENTRY [ 0xffff830d`a0cd4980 - 0xffff830d`a0cd4980 ]
    +0x010 Name             : _UNICODE_STRING "Thread"      <<!>>
    +0x020 DefaultObject    : (null) 
    +0x028 Index            : 0x8 ''
    +0x02c TotalNumberOfObjects : 0x525
    +0x030 TotalNumberOfHandles : 0x745
    +0x034 HighWaterNumberOfObjects : 0x607
    +0x038 HighWaterNumberOfHandles : 0x822
    +0x040 TypeInfo         : _OBJECT_TYPE_INITIALIZER
    +0x0b8 TypeLock         : _EX_PUSH_LOCK
    +0x0c0 Key              : 0x65726854
    +0x0c8 CallbackList     : _LIST_ENTRY [ 0xffff830d`a0cd4a48 - 0xffff830d`a0cd4a48 ]

    ```


## `_OBJECT_HEADER.InfoMask` 관련 리서치
- https://codemachine.com/article_objectheader.html
- The Art of Memory Forensics (Wiley)

  ```
  1: kd> dt _object_header
  nt!_OBJECT_HEADER
    +0x000 PointerCount     : Int8B
    +0x008 HandleCount      : Int8B
    +0x008 NextToFree       : Ptr64 Void
    +0x010 Lock             : _EX_PUSH_LOCK
    +0x018 TypeIndex        : UChar
    +0x019 TraceFlags       : UChar
    +0x019 DbgRefTrace      : Pos 0, 1 Bit
    +0x019 DbgTracePermanent : Pos 1, 1 Bit
    +0x01a InfoMask         : UChar              <<!>>
    +0x01b Flags            : UChar
    +0x01b NewObject        : Pos 0, 1 Bit
    +0x01b KernelObject     : Pos 1, 1 Bit
    +0x01b KernelOnlyAccess : Pos 2, 1 Bit
    +0x01b ExclusiveObject  : Pos 3, 1 Bit
    +0x01b PermanentObject  : Pos 4, 1 Bit
    +0x01b DefaultSecurityQuota : Pos 5, 1 Bit
    +0x01b SingleHandleEntry : Pos 6, 1 Bit
    +0x01b DeletedInline    : Pos 7, 1 Bit
    +0x01c Reserved         : Uint4B
    +0x020 ObjectCreateInfo : Ptr64 _OBJECT_CREATE_INFORMATION
    +0x020 QuotaBlockCharged : Ptr64 Void
    +0x028 SecurityDescriptor : Ptr64 Void
    +0x030 Body             : _QUAD

  0: kd> dt nt!_OBJECT_HEADER_*
            ntkrnlmp!_OBJECT_HEADER_QUOTA_INFO
            ntkrnlmp!_OBJECT_HEADER_PROCESS_INFO
            ntkrnlmp!_OBJECT_HEADER_HANDLE_INFO
            ntkrnlmp!_OBJECT_HEADER_NAME_INFO
            ntkrnlmp!_OBJECT_HEADER_CREATOR_INFO
            ntkrnlmp!_OBJECT_HEADER_AUDIT_INFO
            ntkrnlmp!_OBJECT_HEADER_EXTENDED_INFO
            ntkrnlmp!_OBJECT_HEADER_PADDING_INFO
            OBJECT_HEADER_TO_HANDLE_REVOCATION_INFO
  ```

+ `ffffd08810a83010` pool 분석
  - 0xffffd08810a83010 를 0x10 alignment 를 맞추고 `_POOL_HEADER` 로 캐스팅
  - x64 에서 pool allocation alignment 가 0x10 인가봄
  
  ```python
  
  # volatility3.poolscanner.py 참고
  class PoolScanner(plugins.PluginInterface):
    ...
    @classmethod
      def generate_pool_scan(cls,
                            context: interfaces.context.ContextInterface,
                            layer_name: str,
                            symbol_table: str,
                            constraints: List[PoolConstraint]) 
              -> Generator[Tuple[
                              PoolConstraint, interfaces.objects.ObjectInterface, interfaces.objects.ObjectInterface], None, None]:
          ...
          if symbols.symbol_table_is_64bit(context, symbol_table):
              alignment = 0x10
          else:
              alignment = 8
  ```


  ```
  Pool page ffffd08810a83010 region is Nonpaged pool
  *ffffd08810a83000 size:  c80 previous size:    0  (Allocated) *Proc
      Pooltag Proc : Process objects, Binary : nt!ps

  0: kd> ?? 0xffffd08810a83010  & ~0x10
  unsigned int64 0xffffd088`10a83000

  0: kd> dt nt!_pool_header 0xffffd088`10a83000 -s
    +0x000 PreviousSize     : 0y00000000 (0)
    +0x000 PoolIndex        : 0y00000000 (0)
    +0x002 BlockSize        : 0y11001000 (0xc8)

        `PoolAlignment` x BlockSize 한 값이 실제 allocation size 

        _POOL_HEADER.IterObject() 참고
          ...
          pool_align = self.obj_profile.get_constant("PoolAlignment")
          allocation_size = self.BlockSize * pool_align
          ...

    +0x002 PoolType         : 0y00000010 (0x2)
    +0x000 Ulong1           : 0x2c80000
    +0x004 PoolTag          : 0x636f7250        <<!>> 'corP'
    +0x008 ProcessBilled    : (null) 
    +0x008 AllocatorBackTraceIndex : 0
    +0x00a PoolTagHash      : 0
  ```

  - `!pool` 명령 결과와 동일함을 확인
  ```
  0: kd> !pool 0xffffd088`10a83000
  Pool page ffffd08810a83000 region is Nonpaged pool
  *ffffd08810a83000 size:  c80 previous size:    0  (Allocated) *Proc
      Pooltag Proc : Process objects, Binary : nt!ps

  ```



## _EPROCESS 에서 _POOL_HEADER 찾아가기

+ Target Windows 10 18362 build
    ```
    1: kd> vertarget
    Windows 10 Kernel Version 18362 MP (2 procs) Free x64
    Product: WinNt, suite: TerminalServer SingleUserTS
    Edition build lab: 18362.1.amd64fre.19h1_release.190318-1202
    Machine Name:
    Kernel base = 0xfffff800`124c1000 PsLoadedModuleList = 0xfffff800`129071b0
    Debug session time: Sun Nov  1 20:51:00.790 2020 (UTC + 9:00)
    System Uptime: 3 days 21:49:28.994
    ```


+ `_OBJECT_HEADER` 구조 이해하기
    + `_OBJECT_HEADER.InfoMask` 를 아래 식으로 디코딩하면 유효한 Optional Header 의 오프셋을 구할 수 있음
    
        ```
        nt!ObpInfoMaskToOffset[InfoMask & (DesiredHeaderBit | (DesiredHeaderBit -1))]
        ```
    
    + `DesiredHeaderBit` 상수 정의 (Optional header 관련 상수값)

        ```c++
        #define OB_INFOMASK_PADDING_INFO        0x80

        NtBuildNumber == NT_WIN10_THRESHOLD2
            #define OB_INFOMASK_REOVOCATION_INFO        0x40    
        else
            #define OB_INFOMASK_HEADER_EXTENDED_INFO    0x40

        NtBuildNumber < NT_WIN8_RTM
            #define OB_INFOMASK_PADDING_INFO    0x20    
        else
            #define OB_INFOMASK_AUDIO_INFO      0x20

        #define OB_INFOMASK_PROCESS_INFO    0x10
        #define OB_INFOMASK_QUOTA           0x08
        #define OB_INFOMASK_HANDLE          0x04
        #define OB_INFOMASK_NAME            0x02
        #define OB_INFOMASK_CREATOR_INFO    0x01
        ```

## Optional Header 중 `_OBJECT_HEADER_PADDING_INFO.PaddingAmount` 값 계산식 이해하기
- `_POOL_HEADER` 와 `_OBJECT_HEADER` 사이에 패딩이 얼마만큼 있는지 나타내는 값
- `_OBJECT_HEADER` 주소는 `0xffffd488800752d0` 이고, `InfoMask = 0x80` 일때
    - Optional header 는 `OB_INFOMASK_PADDING_INFO` 를 가짐
    - `?? ((unsigned char *)@@masm(nt!ObpInfoMaskToOffset))[0x80 & (0x80 | (0x80-1))]` 계산을 통해 Offset 은 `0x04`
    - `_OBJECT_HEADER` 주소는 `0xffffd488800752d0` - `0x04` 에 `_OBJECT_HEADER_PADDING_INFO` 구조체가 위치함을 의미함

    ```
    1: kd> ?? ((unsigned char *)@@masm(nt!ObpInfoMaskToOffset))[0x80 & (0x80 | (0x80-1))]
    unsigned char 0x04 ''
    1: kd> dt nt!_OBJECT_HEADER_PADDING_INFO (0xffffd488800752d0-0x04)
    +0x000 PaddingAmount    : 0x30
    ```

    - `_OBJECT_HEADER_PADDING_INFO.PaddingAmount = 0x30` 이므로 

    ```
    1: kd> ? 0xffffd488800752d0 - 0x30 - @@(sizeof(nt!_POOL_HEADER))
    Evaluate expression: -47792248106352 = ffffd488`80075290
    
    ```

    - `_POOL_HEADER` 의 주소는 `0xffffd48880075290` 임

    ```
    1: kd> dt nt!_POOL_HEADER 0xffffd48880075290
    +0x000 PreviousSize     : 0y00000000 (0)
    +0x000 PoolIndex        : 0y11001111 (0xcf)
    +0x002 BlockSize        : 0y11001000 (0xc8)
    +0x002 PoolType         : 0y00000010 (0x2)
    +0x000 Ulong1           : 0x2c8cf00
    +0x004 PoolTag          : 0x636f7250
    +0x008 ProcessBilled    : 0xffffd488`8005bce8 _EPROCESS
    +0x008 AllocatorBackTraceIndex : 0xbce8
    +0x00a PoolTagHash      : 0x8005
    ```

## `system` 프로세스의 `_POOL_HEADER` 찾기

- `0xffffd48880075290	0x00000c80	Proc	0xffffd48880075300	0x00000004	System`

    ```
    -003c   +0000   0xffffd48880075290      +0000   _POOL_HEADER (struct _POOL_HEADER, 9 elements, 0x10 bytes)                                        
                                            +0x000 PreviousSize     : Bitfield Pos 0, 8 Bits
                                            +0x000 PoolIndex        : Bitfield Pos 8, 8 Bits
                                            +0x002 BlockSize        : Bitfield Pos 0, 8 Bits
                                            +0x002 PoolType         : Bitfield Pos 8, 8 Bits
                                            +0x000 Ulong1           : Uint4B
                                            +0x004 PoolTag          : Uint4B
                                            +0x008 ProcessBilled    : Ptr64 to struct _EPROCESS, 226 elements, 0x880 bytes
                                            +0x008 AllocatorBackTraceIndex : Uint2B
                                            +0x00a PoolTagHash      : Uint2B

    -0004   +003c   0xffffd488800752cc      +0000   _OBJECT_HEADER_PADDING_INFO
                                            +0000   PaddingAmount   0x30

    -0030   +0040   0xffffd488800752d0      +0000   OBJECT_HEADER
                                            +0018   TypeIndex       0x18    -> 0x07 (Process object)
                                            +001a   InfoMask        0x80    -> OB_INFOMASK_PADDING_INFO
                                                padding offset      = 0x04 


    +0000   +0070   0xffffd48880075300      +0000   EPROCESS
    ```


## `svchost.exe` 의 `_POOL_HEADER` 찾기
- `0xffffd48880151000	0x00000b80	Proc	0xffffd48880151080	0x00000694	svchost.exe`

    ```
    -0080   +0000   0xffffd48880151000      nt!_pool_header (struct _POOL_HEADER, 9 elements, 0x10 bytes)
                                            +0x000 PreviousSize     : Bitfield 0y00000000 (0)
